---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarConstrainedHandle.Dispose
source: html/a3f03942-2fae-b695-5e20-1867fd7e3698.htm
---
# Autodesk.Revit.DB.Structure.RebarConstrainedHandle.Dispose Method

Releases all resources used by the RebarConstrainedHandle

## Syntax (C#)
```csharp
public void Dispose()
```